# Реализуйте класс Filter, описывающий объект для фильтрации элементов итерируемых объектов. При создании экземпляра класс должен принимать один аргумент:
#     predicate — функция-предикат; если имеет значение None, то работает аналогично функции bool()
# Экземпляр класса Filter должен являться вызываемым объектом и принимать один аргумент:
#     iterable — итерируемый объект
# Экземпляр класса Filter должен возвращать список, элементами которого являются элементы итерируемого объекта iterable, для которых функция predicate вернула значение True.
# Примечание 1. Предикат — это функция, которая возвращает True или False в зависимости от переданного в качестве аргумента значения.
# Примечание 2. Дополнительная проверка данных на корректность не требуется. Гарантируется, что реализованный класс используется только с корректными данными.
# Примечание 3. Никаких ограничений касательно реализации класса Filter нет, она может быть произвольной.

class Filter:
    def __init__(self, predicate=bool):
        self.predicate = predicate

    def __call__(self, iterable):
        return list(filter(self.predicate, iterable))