# Дерево — одна из наиболее широко распространённых структур данных в информатике, эмулирующая древовидную структуру в виде набора связанных узлов.
# Элементы дерева называются узлами. На рисунке выше узлами являются значения 8, 3, 1, 6, 4, 7, 10, 14 и 13. Узлы без потомков называются листьями. На рисунке выше листьями являются значения 1, 4, 7 и 13.
# Реализуйте класс TreeBuilder. При создании экземпляра класс не должен принимать никаких аргументов.
# Экземпляр класса TreeBuilder должен являться реентерабельным контекстным менеджером, который позволяет пошагово строить древовидную структуру данных (дерево).
# Класс TreeBuilder должен иметь два метода экземпляра:
#     add() — метод, принимающий в качестве аргумента произвольный объект (лист) и добавляющий его в текущий узел дерева
#     structure() — метод, возвращающий структуру дерева в виде вложенных списков
# Добавление узлов в дерево должно происходить с помощью оператора with. Узел считается текущим в рамках своего блока with.
# Если в узел не было добавлено ни одного листа, то этот узел не должен появляться в структуре дерева, возвращаемой методом structure().
# Примечание 1. Структура дерева может быть произвольной, то есть узел может содержать другой узел, тот, в свою очередь, другой, и так далее.
# Примечание 2. Гарантируется, что структура дерева не выводится внутри блоков with, то есть структура дерева выводится лишь после ее построения.
# Примечание 3. Наглядные примеры использования класса TreeBuilder продемонстрированы в тестовых данных.
# Примечание 4. Дополнительная проверка данных на корректность не требуется. Гарантируется, что реализованный класс используется только с корректными данными.
# Примечание 5. Класс TreeBuilder должен удовлетворять протоколу контекстного менеджера, то есть иметь методы __enter__() и __exit__(). Реализация же протокола может быть произвольной.

class TreeBuilder:
    def __init__(self):
        self.mydict = {}
        self.count = 0

    def add(self, text):
        self.mydict.setdefault(self.count, []).append(text)

    def structure(self):
        if self.mydict:
            return self.mydict[0]
        return []

    def __enter__(self):
        self.mydict.setdefault(self.count, [])
        self.count += 1

    def __exit__(self, *args, **kwargs):
        temp = self.mydict[self.count]
        self.mydict[self.count] = []
        self.count -= 1
        if temp:
            self.mydict[self.count].append(temp)
