# Реализуйте класс ValueDict, наследника класса dict, описывающий словарь c дополнительным функционалом.
# Процесс создания экземпляра класса ValueDict должен совпадать с процессом создания экземпляра класса dict.
# Класс ValueDict должен иметь два метода экземпляра:
#     key_of() — метод, принимающий в качестве аргумента объект value и возвращающий первый ключ экземпляра класса ValueDict, имеющий значение value.
#     Если такого ключа нет, метод должен вернуть None.
#     keys_of() — метод, принимающий в качестве аргумента объект value и возвращающий итерируемый объект, элементами которого являются все ключи экземпляра класса ValueDict, имеющие значение value
# Примечание 1. Дополнительная проверка данных на корректность не требуется. Гарантируется, что реализованный класс используется только с корректными данными.
# Примечание 2. Никаких ограничений касательно реализации класса ValueDict нет, она может быть произволь

class ValueDict(dict):
    def key_of(self, value):
        for k, v in self.items():
            if v == value:
                return k
        return None

    def keys_of(self, value):
        return (k for k, v in self.items() if v == value)