# 1. Реализуйте класс MinStat, описывающий объект, который находит минимальное значение среди определенного набора чисел.
# При создании экземпляра класс должен принимать один аргумент:
#     iterable — итерируемый объект, определяющий начальный набор чисел. Если не передан, начальный набор считается пустым
# Класс MinStat должен иметь три метода экземпляра:
#     add() — метод, принимающий в качестве аргумента число и добавляющий его в набор
#     result() — метод, возвращающий минимальное число из набора. Если набор пуст, метод должен вернуть значение None
#     clear() — метод, удаляющий из набора все числа
# 2. Также реализуйте класс MaxStat, описывающий объект, который находит максимальное значение среди определенного набора чисел.
# При создании экземпляра класс должен принимать один аргумент:
#     iterable — итерируемый объект, определяющий начальный набор чисел. Если не передан, начальный набор считается пустым
# Класс MaxStat должен иметь три метода экземпляра:
#     add() — метод, принимающий в качестве аргумента число и добавляющий его в набор
#     result() — метод, возвращающий максимальное число из набора. Если набор пуст, метод должен вернуть значение None
#     clear() — метод, удаляющий из набора все числа
# 3. Наконец, реализуйте класс AverageStat, описывающий объект, который находит среднее арифметическое определенного набора чисел.
# При создании экземпляра класс должен принимать один аргумент:
#     iterable — итерируемый объект, определяющий начальный набор чисел. Если не передан, начальный набор считается пустым
# Класс AverageStat должен иметь три метода экземпляра:
#     add() — метод, принимающий в качестве аргумента число и добавляющий его в набор
#     result() — метод, возвращающий среднее арифметическое набора чисел. Если набор пуст, метод должен вернуть значение None
#     clear() — метод, удаляющий из набора все числа
# Примечание 1. Дополнительная проверка данных на корректность не требуется. Гарантируется, что реализованные классы используются только с корректными данными.
# Примечание 2. Никаких ограничений касательно реализаций классов нет, они могут быть произвольными.

class MinStat:
    def __init__(self, iterable=[]):
        self.iterable = iterable

    def add(self, n):
        self.iterable.append(n)

    def result(self):
        return min(self.iterable) if self.iterable else None

    def clear(self):
        self.iterable.clear()

class MaxStat(MinStat):
    def result(self):
        return max(self.iterable) if self.iterable else None

class AverageStat(MinStat):
    def result(self):
        return sum(self.iterable) / len(self.iterable) if self.iterable else None